<a href="https://colab.research.google.com/github/idleyui/python-notebook/blob/master/pdnp.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### dataframe to list

https://stackoverflow.com/questions/23748995/pandas-dataframe-column-to-list

In [0]:
import pandas as pd
import numpy as np

In [0]:
def init_df(raw, c, low=0, high=10):
    arr = np.random.randint(low=low, high=high, size=raw*c)
    arr.resize(raw, c)
    return pd.DataFrame(arr)

In [0]:
df = init_df(3,3)
df

   0  1  2
0  3  1  0
1  6  8  1
2  4  7  9

In [0]:
df.values.tolist()

[[3, 1, 0], [6, 8, 1], [4, 7, 9]]

### sort each raw in DataFrame

https://stackoverflow.com/questions/25817930/fastest-way-to-sort-each-row-in-a-pandas-dataframe

In [0]:
df = init_df(3,3)
df

   0  1  2
0  2  1  4
1  7  2  5
2  7  7  0

In [0]:
df.values.sort()
df

   0  1  2
0  1  2  4
1  2  5  7
2  0  7  7

### remove duplicates

DataFrame.drop_duplicates(subset=None, keep=’first’, inplace=False)

subset: subset column(s) to consider duplicates

keep: 
- 'first': consider first value as unique
- 'last': consider last value as unique
- False: consider all as duplicates

inplace: remove if True, return another removed df if False

In [0]:
df = init_df(3,3, low=0, high=2)
df

   0  1  2
0  0  0  1
1  0  1  0
2  0  1  1

In [0]:
df.drop_duplicates()

   0  1  2
0  0  0  1
1  0  1  0
2  0  1  1

In [0]:
df.drop_duplicates(subset=1)

   0  1  2
0  0  0  1
1  0  1  0

In [0]:
df

   0  1  2
0  0  0  1
1  0  1  0
2  0  1  1

In [0]:
df.drop_duplicates(subset=1, keep=False)

   0  1  2
0  0  0  1

### groupby and remove low freq
https://stackoverflow.com/questions/22391433/count-the-frequency-that-a-value-occurs-in-a-dataframe-column

In [0]:
df = init_df(5,2, high=3)
df

   0  1
0  1  0
1  1  1
2  2  2
3  0  0
4  2  2

In [0]:
df[2] = df.groupby(0)[0].transform('count')
df

   0  1  2
0  1  0  2
1  1  1  2
2  2  2  2
3  0  0  1
4  2  2  2

In [0]:
df = df[df[2]>1]
df

#### flatten

In [0]:
df = df.drop(2, 1)
df

   0  1
0  1  0
1  1  1
2  2  2
4  2  2

In [0]:
df.groupby(0).groups

{1: Int64Index([0, 1], dtype='int64'), 2: Int64Index([2, 4], dtype='int64')}

In [0]:
df = pd.DataFrame([[k, *df[1][v]] for k,v in df.groupby(0).groups.items()])
df

   0  1  2
0  1  0  1
1  2  2  2

/usr/local/lib/python3.6/dist-packages/pandas/core/series.py:942: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

2    2.0
3    NaN
Name: 1, dtype: float64